artillery_test.yaml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  # target: http://localhost:5268/api
  target: http://localhost
  phases:
    - duration: 5
      arrivalRate: 1
      rampTo: 10
      name: Warm up phase
    - duration: 30
      arrivalRate: 15
      rampTo: 25
      name: Ramp up load
    - duration: 10
      arrivalRate: 20
      rampTo: 5
      name: Slow down
scenarios:
  - flow:
      - loop:
          - get:
              url: '/read/api/Contacts'
              headers:
                Authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6InJvZ2VyaW9zb3V6YXhAaG90bWFpbC5jb20iLCJyb2xlIjoiQWRtaW4iLCJmdWxsTmFtZSI6IlJvZ2VyaW8gZGEgU2lsdmEgU291emEiLCJ1c2VySWQiOiIxIiwibmJmIjoxNzM5NzEyMjYxLCJleHAiOjE3Mzk3OTg2NjEsImlhdCI6MTczOTcxMjI2MX0.KKloLEY1HRCgVpMkcKkbzj2BSzHomeMZvxwkanSIevU'
          - get:
              url: '/Contacts?DDD=11'
              headers:
                Authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6InJvZ2VyaW9zb3V6YXhAaG90bWFpbC5jb20iLCJyb2xlIjoiQWRtaW4iLCJmdWxsTmFtZSI6IlJvZ2VyaW8gZGEgU2lsdmEgU291emEiLCJ1c2VySWQiOiIxIiwibmJmIjoxNzM5NzEyMjYxLCJleHAiOjE3Mzk3OTg2NjEsImlhdCI6MTczOTcxMjI2MX0.KKloLEY1HRCgVpMkcKkbzj2BSzHomeMZvxwkanSIevU'
          - get:
              url: '/Contacts/99'
              headers:
                Authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6InJvZ2VyaW9zb3V6YXhAaG90bWFpbC5jb20iLCJyb2xlIjoiQWRtaW4iLCJmdWxsTmFtZSI6IlJvZ2VyaW8gZGEgU2lsdmEgU291emEiLCJ1c2VySWQiOiIxIiwibmJmIjoxNzM5NzEyMjYxLCJleHAiOjE3Mzk3OTg2NjEsImlhdCI6MTczOTcxMjI2MX0.KKloLEY1HRCgVpMkcKkbzj2BSzHomeMZvxwkanSIevU'
        count: 10